import { Todo } from "./types";

// 타입모듈화
// 16-1 타입스크립트의 모듈시스템
// 몯률이라는 개념은 es6의 modules와 비슷
// export와 import 이용

// 실제로는 타입이 많은데 서비스를 구현할때 특정 타입을 한곳에서 분리해서 관리하고 export나 import로 사용

//  import 작성팀 import {} 작성하고 from 뒤의 경로부터 넣어주면 추론.
var item: Todo = {
  title: "할 일 1",
  checked: false,
};

// 16-2 자바스크립트의 모듈시스템
// es6 모듈화란 쉽게 다른 파일에 있는 기능을 특정파일에서 사용할 수 있는 것을 의미
// 기본적으로 자바스크립트의 유효범위는 전역으로, 모듈화가 안돼있는데 변수가 변경되는 오류가 있어 es6부터 모듈화를 지원.
// export import 키워드

// 16-3 전화번호부 애플리케이션에 모듈화실습하기 -인터페이스분리
